glcloud/keil_v5/ARM/PACK/.Web/Keil.Kinetis_SDK_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <name>Kinetis_SDK_DFP</name>
  <description>NXP Kinetis SDK v1.2.0 including MK64FN1M0VLL12 CMSIS Device Support and Drivers</description>
  <url>http://www.keil.com/pack/</url>

  <releases>
    <release version="2.3.0" date="2017-11-17" deprecated="2017-11-17" replacement="NXP.MK64F12_DFP">
      The maintenance of this pack will be discontinued and NXP is providing new packs (NXP.MK64F12_DFP, NXP.FRDM-K64F_BSP)
      CMSIS-Driver:
      - Updated USB Host and Device driver:
      -- Added support for CMSIS-RTOS2
      -- Removed interrupt priority handling
      - Updated EMAC driver: 
      -- corrected return value of the ReadFrame function
      Pack Description:
       - Updated device vendor to NXP.
       - Updated boards description.
      Board Examples:
      - Updated USB Host examples for FRDM-K64F board.
      - Updated projects to change device vendor from Freescale to NXP.
    </release>
    <release version="2.2.0" date="2015-06-19">
      Integrates NXP Kinetis Software Development Kit (KSDK) 1.2.0 (without Examples, CMSIS-DSP and Eclipse updates)
      Updated CMSIS drivers:
      - I2C, MCI, EMAC, SAI, SPI, USART, USB Device, USB Host: Updated initialization, uninitialization and power procedures
      - SAI, SPI, USART: Corrected status bit-field race conditions
    </release>
    <release version="2.1.0" date="2015-04-27">
      CMSIS Driver:
      - Added USART
      - Added SPI
      - Added SAI
      - Updated I2C: Bus clear added
      Added documentation for FRDM-K64F Configuration
      Updated Example USB Device Mass Storage
      RTE_Device configuration file version updated to 1.1.0 (update recommended)
    </release>
    <release version="2.0.0" date="2015-03-20">
      Required PACKs: ARM.CMSIS.4.3.0.pack, Keil.MDK-Middleware.6.3.0.pack, Keil.ARM_Compiler.1.0.0.pack
      Initial version of PACK integrating NXP Kinetis Software Development Kit (KSDK) 1.1.0
      - CMSIS Driver Support
      - Examples for Freedom FRDM-K64F Development Board
      Devices Supported:
      - MK64FN1M0VLL12
    </release>
  </releases>

  <keywords>
  <!-- keywords for indexing -->
    <keyword>NXP</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package NXP</keyword>
    <keyword>Kinetis</keyword>
    <keyword>K Series</keyword>
    <keyword>K6x</keyword>
  </keywords>

  <devices>
    <family Dfamily="K Series" Dvendor="NXP:11">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1"/>
      <environment name="uv">
        <CMisc>--C99</CMisc>
      </environment>
      <sequences>
        <!-- Begin: Pre-defined TraceStart Sequence -->
        <sequence name="TraceStart">
          <block>
            // Nothing required for SWO Trace
            __var traceTPIU   = (__traceout &amp; 0x2) != 0;
            __var traceBuffer = (__traceout &amp; 0x4) != 0;
          </block>

          <control if="traceTPIU">
            <block>
              Sequence("EnableTraceTPIU");
            </block>
          </control>

        </sequence>
        <!-- End: Pre-defined TraceStart Sequence -->

        <!-- Begin: Pre-defined TraceStop Sequence -->
        <sequence name="TraceStop">
          <block>
            // Nothing required for SWO Trace
            __var traceTPIU   = (__traceout &amp; 0x2) != 0;
            __var traceBuffer = (__traceout &amp; 0x4) != 0;
          </block>

          <!--
          <control if="traceTPIU">
            <block>
              Sequence("DisableTraceTPIU");
            </block>
          </control>
          -->

        </sequence>
        <!-- End: Pre-defined TraceStop Sequence -->

        <!-- User-defined Debug Access Sequences -->

        <!-- Begin: User-defined EnableTraceTPIU Sequence -->
        <sequence name="EnableTraceTPIU">
          <block>
            __var tracePortWidth = (__traceout &amp; 0x003F0000) &gt;&gt; 16;

            // Setup fixed TRACECLK pin
            Write32(0x40048038,(Read32(0x40048038) | 0x00002000));      // SIM_SCGC5  : Enable PORT E clock
            Write32(0x40048004,(Read32(0x40048004) | 0x00001000));      // SIM_SOPT2  : Trace Clock Source is set as "Core/system clock"
            Write32(0x4004D000, 0x00000540);  // PTE0: TraceClock, High drive strength
          </block>

          <!-- TRACEDATA[0]-->
            <block>
            Write32(0x4004D010, 0x00000540);  // PTE4: TRACED0   , High drive strength
            </block>


          <control if="tracePortWidth &gt;= 2">
            <!-- TRACEDATA[1]-->
              <block>
                Write32(0x4004D00C, 0x00000540);  // PTE3: TRACED1   , High drive strength
              </block>
          </control>

          <control if="tracePortWidth &gt;= 4">
            <!-- TRACEDATA[2]-->
              <block>
               Write32(0x4004D008, 0x00000540);  // PTE2: TRACED2   , High drive strength
              </block>

            <!-- TRACEDATA[3]-->
              <block>
               Write32(0x4004D004, 0x00000540);  // PTE1: TRACED3   , High drive strength
              </block>
          </control>
        </sequence>
      </sequences>
      <!-- End: User-defined EnableTraceTPIU Sequence -->

      <!-- ******************************  Subfamily 'K6x'  ****************************** -->
      <subFamily DsubFamily="K6x Ethernet Crypto MCUs">
        <description>
The Kinetis K6x MCUs are pin-peripheral and software-compatible with many of the Kinetis K series MCU families,
offering IEEE 1588 Ethernet and full and high-speed USB 2.0 On-The-Go, including options with USB crystal-less functionality.
Devices start from 256 KB of flash in 100 QFP packages extending up to 1 MB flash and 256 KB SRAM in a 256 MAPBGA package.
These devices offer various levels of integration, with a rich suite of analog, communication, timing and control peripherals.
Next-generation Kinetis K6x MCUs are further optimized for performance and power consumption and offer more streamlined
integration for further BOM cost reductions.
        </description>

        <!-- ******************************  Device 'MK64FN1M0VLL12'  ****************************** -->
        <device Dname="MK64FN1M0VLL12">
          <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
          <compile header="platform/devices/fsl_device_registers.h" define="CPU_MK64FN1M0VLL12"/>
          <memory id="IROM1" start="0x00000000" size="0x100000" startup="1" default="1"/>
          <memory id="IRAM1" start="0x20000000" size="0x30000"  init   ="0" default="1"/>
          <memory id="IRAM2" start="0x1FFF0000" size="0x10000"  init   ="0" default="0"/>
          <algorithm name="addon_cmsis/Flash/MK_P1M0.FLM"
                             start="0x00000000" size="0x100000"             default="1"/>
          <debug  svd="platform/devices/MK64F12/MK64F12.svd"/>

          <book name="http://cache.nxp.com/files/microcontrollers/doc/ref_manual/K64P144M120SF5RM.pdf?fasp=1" title="K64 Sub-Family Reference Manual"/>
          <book name="http://cache.nxp.com/files/microcontrollers/doc/data_sheet/K64P144M120SF5.pdf?fasp=1"   title="K64F Sub-Family Data Sheet"/>

          <feature type="ExtBus"       n="32"                      name="External Bus Interface"/>
          <feature type="UART"         n="5"                       name="Universal Asynchronous Receiver/Transmitter"/>
          <feature type="SPI"          n="3"                       name="Serial Peripheral Interface"/>
          <feature type="I2C"          n="3"                       name="Inter-Integrated Circuit"/>
          <feature type="I2S"          n="1"                       name="Integrated Interchip Sound"/>
          <feature type="USBOTG"       n="1"                       name="Universal Serial Bus Full Speed OTG"/>
          <feature type="CAN"          n="1"                       name="CAN"/>
          <feature type="ETH"          n="1"        m="100000000"  name="10/100-Mbps Ethernet MAC"/>
          <feature type="ADC"          n="2"        m="16"         name="ADC"/>
          <feature type="DAC"          n="2"        m="12"         name="DAC"/>
          <feature type="PWM"          n="20"       m="16"         name="Pulse Width Modulation"/>
          <feature type="Timer"        n="21"       m="16"         name="16-bit Timer"/>
          <feature type="Timer"        n="4"        m="32"         name="32-bit Timer"/>
          <feature type="AnalogOther"  n="1"                       name="Comparator"/>
          <feature type="AnalogOther"  n="1"                       name="Voltage Reference"/>
          <feature type="Crypto"       n="128.256"                 name="Cryptographic Acceleration Unit"/>
          <feature type="RNG"                                      name="Random Number Generator"/>
          <feature type="CoreOther"    n="1"                       name="Cyclic Redundancy Check"/>
          <feature type="VCC"          n="1.71"     m="3.6"/>
          <feature type="Temp"         n="-40"      m="105"/>

        </device>
      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- conditions are dependency rules that can apply to a component or an individual file -->
    <condition id="K64FN1M0">            <!-- one condition for each device -->
      <description>NXP Kinetis K64F 1MB devices</description>
      <accept Dvendor="NXP:11" Dname="MK64FN1M0VLL12"/>
    </condition>

    <condition id="K64F12">              <!-- one condition for each device group with same coreclock -->
      <description>NXP Kinetis K64F 120MHz devices</description>
      <accept condition="K64FN1M0"/>
      <!--accept condition="next device with same coreclock"/-->
    </condition>

    <condition id="Kinetis_K64F">        <!-- one condition for device subfamily -->
      <description>NXP Kinetis K64F device and CMSIS-CORE</description>
      <accept condition="K64F12"/>
       <!--accept condition="next devices group within same subfamily"/-->
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="Kinetis">             <!-- one condition for all devices in this pack -->
      <description>NXP Kinetis device and CMSIS-CORE</description>
      <accept condition="Kinetis_K64F"/>
      <!--accept condition="next subfamily"/-->
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

