glcloud/keil_v5/ARM/PACK/.Web/Keil.Kinetis_SDK_DFP.pdsc
    <condition id="Kinetis Unknown">
      <description>NXP Kinetis unknown device and CMSIS-CORE</description>
      <require Dvendor="NXP:11" Dname="MKxxx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="Kinetis_ARMCC">
      <description>NXP Kinetis and the ARM compiler</description>
      <require condition="Kinetis"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="Kinetis_GCC">
      <description>NXP Kinetis and the GCC compiler</description>
      <require condition="Kinetis"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="Kinetis_IAR">
      <description>NXP Kinetis and the IAR compiler</description>
      <require condition="Kinetis"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="Kinetis HAL_RTC">
      <description>NXP Kinetis HAL RTC dependency</description>
      <require condition="Kinetis"/>
      <accept Cclass="Device" Cgroup="KSDK HAL" Csub="MCG"/>
      <accept Cclass="Device" Cgroup="KSDK HAL" Csub="MCG_Lite"/>
    </condition>

    <condition id="Kinetis DRV_ADC16">
      <description>NXP Kinetis Driver ADC16 dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="ADC16"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
    </condition>
    <condition id="Kinetis DRV_AOI">
      <description>NXP Kinetis Driver AOI dependency</description>
      <require condition="Kinetis Unknown"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="AOI"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
    </condition>
    <condition id="Kinetis DRV_CADC">
      <description>NXP Kinetis Driver CADC dependency</description>
      <require condition="Kinetis Unknown"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="CADC"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
    </condition>
    <condition id="Kinetis DRV_CMP">
      <description>NXP Kinetis Driver CMP dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="CMP"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
    </condition>
    <condition id="Kinetis DRV_COP">
      <description>NXP Kinetis Driver COP dependency</description>
      <require condition="Kinetis Unknown"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="COP"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
    </condition>
    <condition id="Kinetis DRV_CRC">
      <description>NXP Kinetis Driver CRC dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="CRC"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
    </condition>
    <condition id="Kinetis DRV_DAC">
      <description>NXP Kinetis Driver DAC dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="DAC"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
    </condition>
    <condition id="Kinetis DRV_DMA">
      <description>NXP Kinetis Driver DMA dependency</description>
      <require condition="Kinetis Unknown"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="DMA"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="DMAMUX"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
    </condition>
    <condition id="Kinetis DRV_DSPI_IRQ">
      <description>NXP Kinetis Driver DSPI IRQ dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="DSPI"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
    </condition>
    <condition id="Kinetis DRV_DSPI_DMA">
      <description>NXP Kinetis Driver DSPI DMA dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="DSPI"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
      <require Cclass="Device" Cgroup="KSDK Driver" Csub="eDMA"/>
    </condition>
    <condition id="Kinetis DRV_EDMA">
      <description>NXP Kinetis Driver eDMA dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="eDMA"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="DMAMUX"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
    </condition>
    <condition id="Kinetis DRV_ENC">
      <description>NXP Kinetis Driver ENC dependency</description>
      <require condition="Kinetis Unknown"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="ENC"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
    </condition>
    <condition id="Kinetis DRV_ENET">
      <description>NXP Kinetis Driver ENET dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="ENET"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
    </condition>
