glcloud/keil_v5/ARM/PACK/.Web/Keil.Kinetis_SDK_DFP.pdsc
    <condition id="Kinetis DRV_EWM">
      <description>NXP Kinetis Driver EWM dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="EWM"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
    </condition>
    <condition id="Kinetis DRV_FLEXBUS">
      <description>NXP Kinetis Driver FLEXBUS dependency</description>
      <require condition="Kinetis Unknown"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="FLEXBUS"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
    </condition>
    <condition id="Kinetis DRV_FlexCAN">
      <description>NXP Kinetis Driver FlexCAN dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="FlexCAN"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
    </condition>
    <condition id="Kinetis DRV_FLEXIO">
      <description>NXP Kinetis Driver FLEXIO dependency</description>
      <require condition="Kinetis Unknown"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="FLEXIO"/>
    </condition>
    <condition id="Kinetis DRV_FLEXIO_I2C">
      <description>NXP Kinetis Driver FLEXIO I2C dependency</description>
      <require condition="Kinetis Unknown"/>
      <require Cclass="Device" Cgroup="KSDK Driver" Csub="FLEXIO"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="FLEXIO_I2C"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
      <accept  Cclass="Device" Cgroup="KSDK Driver" Csub="DMA"/>
      <accept  Cclass="Device" Cgroup="KSDK Driver" Csub="eDMA"/>
    </condition>
    <condition id="Kinetis DRV_FLEXIO_I2S">
      <description>NXP Kinetis Driver FLEXIO I2S dependency</description>
      <require condition="Kinetis Unknown"/>
      <require Cclass="Device" Cgroup="KSDK Driver" Csub="FLEXIO"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="FLEXIO_I2S"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
      <accept  Cclass="Device" Cgroup="KSDK Driver" Csub="DMA"/>
      <accept  Cclass="Device" Cgroup="KSDK Driver" Csub="eDMA"/>
    </condition>
    <condition id="Kinetis DRV_FLEXIO_SPI">
      <description>NXP Kinetis Driver FLEXIO SPI dependency</description>
      <require condition="Kinetis Unknown"/>
      <require Cclass="Device" Cgroup="KSDK Driver" Csub="FLEXIO"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="FLEXIO_SPI"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
      <accept  Cclass="Device" Cgroup="KSDK Driver" Csub="DMA"/>
      <accept  Cclass="Device" Cgroup="KSDK Driver" Csub="eDMA"/>
    </condition>
    <condition id="Kinetis DRV_FLEXIO_UART_IRQ">
      <description>NXP Kinetis Driver FLEXIO UART IRQ dependency</description>
      <require condition="Kinetis Unknown"/>
      <require Cclass="Device" Cgroup="KSDK Driver" Csub="FLEXIO"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="FLEXIO_UART"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
    </condition>
    <condition id="Kinetis DRV_FLEXIO_UART_DMA">
      <description>NXP Kinetis Driver FLEXIO UART DMA dependency</description>
      <require condition="Kinetis Unknown"/>
      <require Cclass="Device" Cgroup="KSDK Driver" Csub="FLEXIO"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="FLEXIO_UART"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
      <accept  Cclass="Device" Cgroup="KSDK Driver" Csub="DMA"/>
      <accept  Cclass="Device" Cgroup="KSDK Driver" Csub="eDMA"/>
    </condition>
    <condition id="Kinetis DRV_FTM">
      <description>NXP Kinetis Driver FTM dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="FTM"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
    </condition>
    <condition id="Kinetis DRV_GPIO">
      <description>NXP Kinetis Driver GPIO dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="GPIO"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="PORT"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
    </condition>
    <condition id="Kinetis DRV_I2C">
      <description>NXP Kinetis Driver I2C dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="I2C"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
    </condition>
    <condition id="Kinetis DRV_LMEM">
      <description>NXP Kinetis Driver LMEM dependency</description>
      <require condition="Kinetis Unknown"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="LMEM"/>
    </condition>
    <condition id="Kinetis DRV_LPSCI_IRQ">
      <description>NXP Kinetis Driver LPSCI IRQ dependency</description>
      <require condition="Kinetis Unknown"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="LPSCI"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="LPTMR"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="SIM"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
    </condition>
    <condition id="Kinetis DRV_LPSCI_DMA">
      <description>NXP Kinetis Driver LPSCI DMA dependency</description>
      <require condition="Kinetis Unknown"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="LPSCI"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="LPTMR"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="SIM"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
      <require Cclass="Device" Cgroup="KSDK Driver" Csub="DMA"/>
    </condition>
    <condition id="Kinetis DRV_LPTMR">
      <description>NXP Kinetis Driver LPTMR dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="LPTMR"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="SIM"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
    </condition>
    <condition id="Kinetis DRV_LPUART_IRQ">
      <description>NXP Kinetis Driver LPUART IRQ dependency</description>
      <require condition="Kinetis Unknown"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="LPUART"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
    </condition>
    <condition id="Kinetis DRV_LPUART_DMA">
      <description>NXP Kinetis Driver LPUART DMA dependency</description>
      <require condition="Kinetis Unknown"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="LPUART"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
      <accept  Cclass="Device" Cgroup="KSDK Driver" Csub="DMA"/>
      <accept  Cclass="Device" Cgroup="KSDK Driver" Csub="eDMA"/>
    </condition>
