glcloud/keil_v5/ARM/PACK/.Web/Keil.Kinetis_SDK_DFP.pdsc
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="LPTMR" Cversion="1.2.0" condition="Kinetis">
      <description>Low Power Timer (LPTMR)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_LPTMR
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__lptmr__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_lptmr_hal.h"/>
        <file category="source" name="platform/hal/src/lptmr/fsl_lptmr_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="LPUART" Cversion="1.2.0" condition="Kinetis Unknown">
      <description>Low Power Universal Asynchronous Receiver/Transmitter (LPUART)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_LPUART
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__lpuart__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_lpuart_hal.h"/>
        <file category="source" name="platform/hal/src/lpuart/fsl_lpuart_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="MCG" Cversion="1.2.0" condition="Kinetis">
      <description>Multipurpose Clock Generator (MCG)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_MCG
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__mcg__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_mcg_hal.h"/>
        <file category="header" name="platform/hal/inc/fsl_mcg_hal_modes.h"/>
        <file category="source" name="platform/hal/src/mcg/fsl_mcg_hal.c"/>
        <file category="source" name="platform/hal/src/mcg/fsl_mcg_hal_modes.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="MCG_Lite" Cversion="1.2.0" condition="Kinetis Unknown">
      <description>Multipurpose Clock Generator Lite (MCG_Lite)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_MCG_LITE
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__mcglite__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_mcglite_hal.h"/>
        <file category="header" name="platform/hal/inc/fsl_mcglite_hal_modes.h"/>
        <file category="source" name="platform/hal/src/mcglite/fsl_mcglite_hal.c"/>
        <file category="source" name="platform/hal/src/mcglite/fsl_mcglite_hal_modes.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="MMDVSQ" Cversion="1.2.0" condition="Kinetis Unknown">
      <description>Memory-Mapped Divide and Square Root(MMDVSQ)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_MMDVSQ
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__mmdvsq__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_mmdvsq_hal.h"/>
        <file category="source" name="platform/hal/src/mmdvsq/fsl_mmdvsq_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="MPU" Cversion="1.2.0" condition="Kinetis">
      <description>Memory Protection Unit (MPU)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_MPU
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__mpu__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_mpu_hal.h"/>
        <file category="source" name="platform/hal/src/mpu/fsl_mpu_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="OSC" Cversion="1.2.0" condition="Kinetis">
      <description>Oscillator (OSC)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_OSC
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__osc__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_osc_hal.h"/>
        <file category="source" name="platform/hal/src/osc/fsl_osc_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="PDB" Cversion="1.2.0" condition="Kinetis">
      <description>Programmable Delay Block (PDB)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_PDB
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__pdb__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_pdb_hal.h"/>
        <file category="source" name="platform/hal/src/pdb/fsl_pdb_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="PIT" Cversion="1.2.0" condition="Kinetis">
      <description>Periodic Interrupt Timer (PIT)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_PIT
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__pit__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_pit_hal.h"/>
        <file category="source" name="platform/hal/src/pit/fsl_pit_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="PMC" Cversion="1.2.0" condition="Kinetis">
      <description>Power Management Controller (PMC)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_PMC
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__pmc__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_pmc_hal.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="PORT" Cversion="1.2.0" condition="Kinetis">
      <description>Port Control and Interrupts (PORT)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_PORT
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__port__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_port_hal.h"/>
        <file category="source" name="platform/hal/src/port/fsl_port_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="PWM" Cversion="1.2.0" condition="Kinetis">
      <description>Pulse Width Modulator (PWM)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_PWM
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__pwm__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_pwm_hal.h"/>
        <file category="source" name="platform/hal/src/pwm/fsl_pwm_hal.c"/>
      </files>
    </component>
